Config/Catalogs/КолонкиОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КолонкиОтчетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыОтчетов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗначения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗначенийПоказателейОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОбработки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОбработкиПоказателейОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешРеквизитов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/КолонкиОтчетов/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ОБЪЕКТА

// Процедура - обработчик события объекта "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ)
	
	РассчитатьХешПоРеквизитамОбъекта();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ РЕОРГАНИЗАЦИИ ЗАВИСИМЫХ ДАННЫХ
//

Функция НеобходимаРеорганизацияДанных() Экспорт
	
	Возврат Ложь;
	
КонецФункции

Процедура ВыполнитьРеорганизациюДанных() Экспорт
	
	
	
КонецПроцедуры

Процедура РассчитатьХешПоРеквизитамОбъекта() Экспорт
	
	Если ОбменДанными.Загрузка Тогда 
		Если ОбменДанными.Отправитель <> Неопределено Тогда
			//Если это загрузка данных из главного узла, то ничего делать не нужно.
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ХешОбновлен")
		И ЗначениеЗаполнено(ХешРеквизитов) Тогда
		Возврат;	
	КонецЕсли;
	
	ДопустимыеВР = БюджетнаяОтчетностьСервер.ПолучитьДопустимыеВидыРеквизитаДляХеша();
	//Порядок следования реквизитов: стандартные, по алфавиту, обычные, по алфавиту
	МассивФормированияХеша = Новый Массив;
	БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(ЭтотОбъект,"Код",МассивФормированияХеша,ДопустимыеВР.Строка,ДопустимыеВР);
	БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(ЭтотОбъект,"Наименование",МассивФормированияХеша,ДопустимыеВР.Строка,ДопустимыеВР);
	БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(ЭтотОбъект,"ПометкаУдаления",МассивФормированияХеша,ДопустимыеВР.Булево,ДопустимыеВР);
	
	БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(ЭтотОбъект,"ПорядковыйНомер",МассивФормированияХеша,ДопустимыеВР.Строка,ДопустимыеВР);
	БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(ЭтотОбъект,"СпособОбработки",МассивФормированияХеша,ДопустимыеВР.Перечисление,ДопустимыеВР);
	БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(ЭтотОбъект,"ТипЗначения",МассивФормированияХеша,ДопустимыеВР.Перечисление,ДопустимыеВР);
		
	СтрокаХеша = СтрСоединить(МассивФормированияХеша);
	ХешированиеД = Новый ХешированиеДанных(ХешФункция.MD5);
	ХешированиеД.Добавить(СтрокаХеша);
	 
	ХешРеквизитов = Base64Строка(ХешированиеД.ХешСумма);

	ХешированиеД = Неопределено;
	МассивФормированияХеша = Неопределено;
		
КонецПроцедуры

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
